app/Controllers/Admin.php

    public function dashboard()
    {
        $session = session();

        $db = \Config\Database::connect();

        // Basic counts and sums
        $totalUsers = (int) $db->table('users')->countAllResults();
        $row = $db->query('SELECT COALESCE(SUM(solde),0) AS total FROM user_wallet')->getRow();
        $totalWallet = $row ? $row->total : 0;
        $totalRegimes = (int) $db->table('regimes')->countAllResults();
        $totalActivites = (int) $db->table('activites')->countAllResults();
        $totalCodes = (int) $db->table('codes_wallet')->countAllResults();
        $usedCodes = (int) $db->table('codes_wallet')->where('est_utilise', 1)->countAllResults();
        $unusedCodes = $totalCodes - $usedCodes;

        // Top 5 users by wallet balance
        $topUsersQuery = $db->table('users u')
            ->select('u.id, u.nom, COALESCE(w.solde,0) AS solde')
            ->join('user_wallet w', 'w.id_user = u.id', 'left')
            ->orderBy('solde', 'DESC')
            ->limit(5)
            ->get();

        $topUsers = $topUsersQuery->getResult();
---
SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT `u`.`id`, `u`.`nom`, COALESCE(w.solde, 0) AS solde
FROM `users` `u`
LEFT JOIN `user_wallet` `w` ON `w`.`id_user` = `u`.`id`
ORDER BY `solde` DESC
 LIMIT 5

        }

        // Objective distribution
        $objectiveData = $db->table('user_health')
            ->select('objectif, COUNT(*) as count')
            ->groupBy('objectif')
            ->get()
            ->getResultArray();
---
SELECT `objectif`, COUNT(*) as count
FROM `user_health`
GROUP BY `objectif`

    public function regimesIndex()
    {
        $regimes = $this->regimeModel->findAll();
---
SELECT *
FROM `regimes`

    public function activitesIndex()
    {
        $activites = $this->activiteModel->findAll();
---
SELECT *
FROM `activites`