app/Controllers/Auth.php

    public function handleLogin()
    {
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        if (empty($email) || empty($password)) {
            return redirect()->back()->with('error', 'Email et mot de passe requis');
        }

        $db = db_connect();
        $user = $db->table('users')->where('email', $email)->get()->getRowArray();
---
SELECT *
FROM `users`
WHERE `email` = 'fr@gmail.com'

    public function profile()
    {
        $userId = session('user_id');
        if (!$userId) {
            return redirect()->to('/auth/login');
        }

        $db = db_connect();
        $user = $db->table('users')->where('id', $userId)->get()->getRowArray();
        $health = $db->table('user_health')->where('id_user', $userId)->get()->getRowArray();
---
SELECT *
FROM `users`
WHERE `id` = '2'
SELECT *
FROM `user_health`
WHERE `id_user` = '2'

    public function updateProfile()
    {
        $userId = session('user_id');
        if (!$userId) {
            return redirect()->to('/auth/login');
        }
        $db = db_connect();
        $user = $db->table('users')->where('id', $userId)->get()->getRowArray() ?? [];
        $health = $db->table('user_health')->where('id_user', $userId)->get()->getRowArray() ?? [];
---
SELECT *
FROM `users`
WHERE `id` = '1'
SELECT *
FROM `user_health`
WHERE `id_user` = '1'

        }
        $db->transStart();

        $db->table('users')->where('id', $userId)->update([
            'nom' => $nomComplet === '' ? ($nom ?? '') : $nomComplet,
            'email' => $email,
            'genre' => $genre,
            'date_naissance' => $dateNaissance,
        ]);

        $health = $db->table('user_health')->where('id_user', $userId)->get()->getRowArray();
        if ($health) {
            $db->table('user_health')->where('id_user', $userId)->update([
                'taille_cm' => $taille,
                'poids_kg' => $poids,
                'objectif' => $objectif,
            ]);
---
UPDATE `users` SET `nom` = 'sedra pepeta', `email` = 'fr@gmail.com', `genre` = 'autre', `date_naissance` = '2026-05-06'
WHERE `id` = '1'
SELECT *
FROM `user_health`
WHERE `id_user` = '1'
UPDATE `user_health` SET `taille_cm` = '160.00', `poids_kg` = '40.00', `objectif` = 'reduire'
WHERE `id_user` = '1'

    public function objectifsData()
    {
        $objectif = $this->request->getGet('objectif');

        $db = db_connect();
        $regimesBuilder = $db->table('regimes')->where('actif', 1);

        if ($objectif === 'augmenter') {
            $regimesBuilder->where('variation_poids >', 0);
        } elseif ($objectif === 'reduire') {
            $regimesBuilder->where('variation_poids <', 0);
        } elseif ($objectif === 'imc_ideal') {
            $regimesBuilder->where('variation_poids >=', -0.2)->where('variation_poids <=', 0.2);
        }

        $regimes = $regimesBuilder->orderBy('variation_poids', 'DESC')->limit(3)->get()->getResultArray();

        if (empty($regimes)) {
            $regimes = $db->table('regimes')
                ->where('actif', 1)
                ->orderBy('prix', 'ASC')
                ->limit(3)
                ->get()
                ->getResultArray();
        }

        $activites = $db->table('activites')
            ->where('actif', 1)
            ->orderBy('intensite', 'ASC')
            ->limit(3)
            ->get()
            ->getResultArray();
---
SELECT *
FROM `regimes`
WHERE `actif` = 1
AND `variation_poids` < 0
ORDER BY `variation_poids` DESC
 LIMIT 3
SELECT *
FROM `activites`
WHERE `actif` = 1
ORDER BY `intensite` ASC
 LIMIT 3

    public function exportPDF()
    {
        $session = session();
        $userId = $session->get('user_id');

        if (!$userId) {
            return redirect()->to('/auth/login')->with('error', 'Veuillez vous connecter');
        }

        $db = db_connect();
        $user = $db->table('users')->where('id', $userId)->get()->getRowArray();
        $health = $db->table('user_health')->where('id_user', $userId)->get()->getRowArray();
        $subscriptions = $db->table('user_regimes')
            ->select('user_regimes.*, regimes.nom, regimes.description, regimes.prix')
            ->join('regimes', 'user_regimes.id_regime = regimes.id')
            ->where('user_regimes.id_user', $userId)
            ->where('user_regimes.est_actif', 1)
            ->get()
            ->getResultArray();
---
SELECT *
FROM `users`
WHERE `id` = '1'
SELECT *
FROM `user_health`
WHERE `id_user` = '1'
SELECT `user_regimes`.*, `regimes`.`nom`, `regimes`.`description`, `regimes`.`prix`
FROM `user_regimes`
JOIN `regimes` ON `user_regimes`.`id_regime` = `regimes`.`id`
WHERE `user_regimes`.`id_user` = '1'
AND `user_regimes`.`est_actif` = 1