app/Controllers/Dashboard.php

SELECT *
FROM `users`
WHERE `id` = 1
SELECT *
FROM `user_health`
WHERE `id_user` = 1
SELECT *
FROM `user_wallet`
WHERE `id_user` = 1
SELECT `user_regimes`.*, `regimes`.`nom`, `regimes`.`description`, `regimes`.`prix`, `regimes`.`duree_jours`
FROM `user_regimes`
JOIN `regimes` ON `user_regimes`.`id_regime` = `regimes`.`id`
WHERE `user_regimes`.`id_user` = 1
AND `user_regimes`.`est_actif` = 1
ORDER BY `user_regimes`.`created_at` DESC
---
    private function fetchUserContext(): array
    {
        $userId = (int) session()->get('user_id');
        $db = db_connect();

        $user = $db->table('users')->where('id', $userId)->get()->getRowArray() ?? [];
        $health = $db->table('user_health')->where('id_user', $userId)->get()->getRowArray() ?? [];
        $wallet = $db->table('user_wallet')->where('id_user', $userId)->get()->getRowArray() ?? [];
        $subscriptions = $db->table('user_regimes')
            ->select('user_regimes.*, regimes.nom, regimes.description, regimes.prix, regimes.duree_jours')
            ->join('regimes', 'user_regimes.id_regime = regimes.id')
            ->where('user_regimes.id_user', $userId)
            ->where('user_regimes.est_actif', 1)
            ->orderBy('user_regimes.created_at', 'DESC')
            ->get()
            ->getResultArray();

SELECT *
FROM `regimes`
WHERE `actif` = 1
AND `variation_poids` >= -0.2
AND `variation_poids` <= 0.2
ORDER BY `prix` ASC
 LIMIT 6
---
    private function fetchSuggestedRegimes(string $objectif, bool $isGold): array
    {
        $db = db_connect();
        $builder = $db->table('regimes')->where('actif', 1);

        if ($objectif === 'augmenter') {
            $builder->where('variation_poids >', 0);
        } elseif ($objectif === 'reduire') {
            $builder->where('variation_poids <', 0);
        } else {
            $builder->where('variation_poids >=', -0.2)->where('variation_poids <=', 0.2);
        }

        $regimes = $builder->orderBy('prix', 'ASC')->limit(6)->get()->getResultArray();