app/Controllers/Wallet.php

    public function balance()
    {
        $session = session();
        $userId = $session->get('user_id') ?? $this->request->getVar('user_id');

        if (empty($userId)) {
            return $this->response->setJSON([
                'success' => false,
                'message' => 'Utilisateur non spécifié.',
                'data' => null,
                'errors' => ['user_id' => 'missing']
            ])->setStatusCode(ResponseInterface::HTTP_BAD_REQUEST);
        }

        $db = \Config\Database::connect();
        $builder = $db->table('user_wallet');
        $row = $builder->where('id_user', $userId)->get()->getRowArray();
---
SELECT *
FROM `user_wallet`
WHERE `id_user` = '1'


        // Ensure user_wallet exists
        $walletTable = $db->table('user_wallet');
        $wallet = $walletTable->where('id_user', $userId)->get()->getRowArray();
---
SELECT *
FROM `user_wallet`
WHERE `id_user` = '1'